#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_eip.eip_02: Refreshing state... [id=eipalloc-04ae2173926c84895]
aws_eip.eip_01: Refreshing state... [id=eipalloc-0b14c2410771b71e7]
data.aws_iam_policy_document.assume_role: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-04ab05990fc02a7b9]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231011060543488100000002]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231011060543415100000001]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0551b3caa7c364c30]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-07add93cddb2fbf3a]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0acb089d1881a68ed]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0664b54ff477ec6ae]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-0dc6390f79098f47a]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-00f68a80b8ab2e425]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0568a703a500fb4d5]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0b9bdeb07e8d73a1f]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-06d8dbc13b1edf965]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-051e83ca71698c6e4]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0a4a8f7b5faf2dbfb]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-026eb8b5a2455b12c]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-05a400293669cee93]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-053921ad670d4bb65]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-085105d3835db6e0f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_node_group.app_node_group will be created
  + resource "aws_eks_node_group" "app_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "earth-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "app-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0551b3caa7c364c30",
          + "subnet-0dc6390f79098f47a",
        ]
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-074722705350fe8a1"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.iam_role_eks_node_group will be created
  + resource "aws_iam_role" "iam_role_eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:ap-northeast-2:318374019075:eks-share",
                        ]
                      + Sid      = "MountpointFullBucketAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:AbortMultipartUpload",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:ap-northeast-2:318374019075:eks-share/*",
                        ]
                      + Sid      = "MountpointFullObjectAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "earth-dev-eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "earth-dev-eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "earth-dev-eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "earth-dev-eks-node-group-role"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*